// 给出一个 32 位的有符号整数，你需要将这个整数中每位上的数字进行反转。

// 示例 1:

// 输入: 123
// 输出: 321
//  示例 2:

// 输入: -123
// 输出: -321
// 示例 3:

// 输入: 120
// 输出: 21
// 注意:

// 假设我们的环境只能存储得下 32 位的有符号整数，则其数值范围为 [−231,  231 − 1]。请根据这个假设，如果反转后整数溢出那么就返回 0。
// 、、、javascript
// /**
//  * @param {number} x
//  * @return {number}
//  */
 var reverse = function(x) {
    let result = 0;
    while(x !== 0) {
        result = result * 10 + x % 10;
        x = (x / 10) | 0;
    }
    return (result | 0) === result ? result : 0;
};
//假设传参x=123
//当x!=0时进入while循环
//第一轮 r = 0*10 + 123 % 10 = 3 ; x = 12
//第二轮 r = 3*10 + 12 % 10 = 32 ; x = 1
//第三轮 r = 32*10 + 1 % 10 = 321 ; x = 0
//当x=0 时跳出循环 
//result | 0  判断是否为32位的有符号整数
//输出r = 321
//、、、